not_statistica/tests.tex
% Created 2021-11-03 Mi 20:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{geometry}\geometry{a4paper,left=15mm,right=20mm,top=20mm,bottom=30mm}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}


\section*{misc}
\label{sec:org8d8c067}
\begin{itemize}
\item \(P(A|B) = \frac {P(A \cap B)}{P(B)}\)
\item Bayes: \(P(B|A) = \frac {P(A|B) P(B)}{P(A)}\)
\item \(\displaystyle (S^*)^2 = \frac{n}{n-1} S^2 = \frac{1}{n-1} \sum_{i=1}^{n} (X_i- \bar{X})^2\);
\item \(S^* = \sqrt{(S^*)^2}, S = \sqrt{S^2}\)
\item \(\mathrm{Var}(X) = \mathbb{E}(X^2) - \left(\mathbb{E}(X)\right)^2\);

\item \(\mathrm{cov}(X, Y) = \mathbb{E}\left(( X - \bar{X}  ) (Y - \bar{Y}) \right) = \mathbb{E}(XY) - \mathbb{E}(X)\mathbb{E}(Y)\);
\end{itemize}
\section*{ordinary least squares}
\label{sec:orgb8a25d8}

\[ b  = \frac{\sum(X-\bar{X})(Y-\bar{Y})}{\sum(X-\bar{X})^2} = \frac{\sum xy}{x^2}, \]
\(x =X-\bar{X}, y =Y-\bar{Y}\)

\(a\) from \(Y=a + bX\)

(the line goes to through \((\bar{X}, \bar{Y})\))

\subsection*{standard error:}
\label{sec:org52977cb}
the correct regresion line is \(Y_i = \alpha_i+\beta_i X_i + \varepsilon_i\)

Standard error:
\[ \mathrm{SE} = \frac{\sigma }{\sqrt{\sum x^2}} = \frac{\sigma}{\sqrt{n} S_x} \]

Smol SE is good.

\subsection*{standard squared error}
\label{sec:orgddda237}
(we lost 2 degs of freedom)

\[ \mathrm{SSE} = \frac{1}{n-2} \sum (Y-\hat{Y})^2 \]


\subsection*{P values and stuff}
\label{sec:org6f7c713}
\[ t = \frac{b}{\mathrm{SE}} \]

\(H_0\): b = 0 (ie there's no relation)

if \(t  > T_{\alpha}^{(n-2)}\) then we reject \(H_0\)

else we don't

(with \(\alpha\) liek .005)
\subsection*{F-statistic}
\label{sec:org7e72ff6}
(dont worry about it)

similar to T (from above, but with)

\[F = \frac{\mathrm{RegSS}}{\mathrm{SSE}/(n-2)}\]

and reject if \(>F^{(1, n-2)}_\alpha\)

\subsection*{R\textsuperscript{2}}
\label{sec:org2560984}

\[ R^2 = \frac{\mathrm{RegSS}}{\mathrm{TSS}} = 1 - \frac{SSE}{TSS} = 1 - \frac{\sum (Y-\bar{Y})^2}{\sum (Y-\hat{Y})^2} \]

\(\hat{Y}\) is the esitmated value of Y (ie \(\hat{Y} = a + b X\))

\(\mathrm{RegSS} = \sum (\hat{Y}-\bar{Y})^2\)


\section*{Confidence intervals - tl;dr (this is a lot more information than we need)}
\label{sec:org4a06954}
\subsection*{for the average}
\label{sec:org4eaea18}
\renewcommand{\arraystretch}{2}
  \begin{tabular}{|l|l|l|l|l|l|}
  \hline
  type & useful & \(X\) type & $n$ size & \(\sigma\) known & the interval  \\
\hline
  bilateral & x   & \(~\mathcal{N} (\mu, \sigma^2) \) & whatever & yes &
  \( \mu \in \left(\bar{X} - \dfrac{\sigma}{\sqrt{n}} z_{1-\alpha/2}, \bar{X} + \dfrac{\sigma}{\sqrt{n}} z_{1-\alpha/2}\right)
 \) \\ \hline
bilateral & x   & whatever & big & yes &
  \( \mu \in \left(\bar{X} - \dfrac{\sigma}{\sqrt{n}} z_{1-\alpha/2}, \bar{X} + \dfrac{\sigma}{\sqrt{n}} z_{1-\alpha/2}\right)
 \) \\ \hline
 no sup &    & \(\sim\mathcal{N} (\mu, \sigma^2) \) & big & yes &
  \( \mu \in \left(\bar{X} - \dfrac{\sigma}{\sqrt{n}} z_{1-\alpha}, \infty \right)
 \) \\ \hline
 no inf &    & \(\sim\mathcal{N} (\mu, \sigma^2) \) & big & yes &
  \( \mu \in \left(-\infty, \bar{X} + \dfrac{\sigma}{\sqrt{n}} z_{1-\alpha}\right)
 \) \\ \hline
 bilateral & x  & whatever & big & no &
  \( \mu \in \left(\bar{X} - \dfrac{S^*}{\sqrt{n}} z_{1-\alpha/2}, \bar{X} + \dfrac{S^*}{\sqrt{n}} z_{1-\alpha/2}\right)
 \) \\ \hline
unilateral &  & whatever & big & no &
like rows 2 and 3 but with \(S^*\)
  \\ \hline
bilateral & x   & \(\sim\mathcal{N} (\mu, \sigma^2) \)  & smol & no &
  \( \mu \in \left(\bar{X} - \dfrac{S^*}{\sqrt{n}} t_{1-\alpha/2,n-1}, \bar{X} + \dfrac{S^*}{\sqrt{n}} t_{1-\alpha/2, n-1}\right)
 \) \\ \hline
unilateral &    & \(\sim\mathcal{N} (\mu, \sigma^2) \)  & smol & no &
like rows 2 and 3 but with \(S^*\) and \(t_{1-\alpha, n-1} 
 \) \\ \hline

  \end{tabular}

\subsection*{for the variance (dispersion)}
\label{sec:orgba23d0b}
just ignore this

\renewcommand{\arraystretch}{2}
  \begin{tabular}{|l|l|l|l|l|l|}
  \hline
  type &  where to find & \(X\) type & $n$ size & \(\mu\) known & the interval  \\
\hline
  bilateral & C5 - pg 6   & \(\sim\mathcal{N} (\mu, \sigma^2) \) & smol & yes &
  \( \displaystyle \sigma^2 \in \left( \frac{\sum_{i=1}^n (X_i-\mu)^2}{\chi^2_{\alpha/2, n}}, 
\frac{\sum_{i=1}^n (X_i-\mu)^2}{\chi^2_{1-\alpha/2, n}}  \right)
\) \\ \hline

bilateral & C5 - pg 6   & \(\sim\mathcal{N} (\mu, \sigma^2) \) & smol & no &
  \( \displaystyle \sigma^2 \in \left( \frac{(n-1) (S^*)^2 }{\chi^2_{\alpha/2, n-1}}, 
\frac{(n-1) (S^*)^2 }{\chi^2_{1-\alpha/2, n-1}}, \right)
 \) \\ \hline

  \end{tabular}

\medskip
for \(n\) large, look at C5 pg 7 - obs 1.3
tl;dr we make it a normal distribution


\section*{Testarea ipotezelor statistice - tl;dr}
\label{sec:org90fc018}
don't worry about it
\subsection*{For the average}
\label{sec:org6f82878}
\((H_0): \mu = \mu_0\)
\medskip

  \renewcommand{\arraystretch}{2}
  \begin{tabular}{|l|l|l|l|l|l|l|}
  \hline
  name   &    where to find & \(X\) type & $n$ size & \(\sigma\) known & $\text{thing}_0$ & bilateral tl;dr  \\
\hline
  \(Z\) test  & C6 - pg 6-9   & \(\sim\mathcal{N} (\mu, \sigma^2) \) & big & yes &
  \(z_0 = \dfrac{\bar{x} - \mu_0}{\sigma / \sqrt{n}} \) & \(z_0 \in \left( -z_{1-\alpha/2}, z_{1-\alpha/2} \right) \) \\
 \hline
  \(T\) test  & C6 - pg 10-13   & \(\sim\mathcal{N} (\mu, \sigma^2) \) & smol & no  &
  \(z_0 = \dfrac{\bar{x} - \mu_0}{s^* / \sqrt{n}} \) & \( t_0 \in \left( -t_{1-\alpha/2,n-1}, t_{1-\alpha/2, n-1} \right) \) \\
\hline
  \end{tabular}

\subsection*{For the variance (dispersion)}
\label{sec:orgff498de}
\((H_0): \sigma = \sigma_0\)
\medskip

\(\chi^2\)-test


\(\chi^2_0 = \dfrac{(n-1) (s^*)^2}{\sigma_0^2} \)
\medskip

\(H_0\) is acepted (or pedantically  "not rejected") if:

\( \chi^2_0 \in (\chi^2_{1-\alpha/2, n-1}, \chi^2_{1-\alpha/2, n-1}) \)

\bigskip


Sun Tzu said: “All exams are based on deception”.

(the quote in statistics was better)
\end{document}